#ifndef UE4SS_SDK_BP_PalRandomIncidentObjectPlacement_Test_HPP
#define UE4SS_SDK_BP_PalRandomIncidentObjectPlacement_Test_HPP

class ABP_PalRandomIncidentObjectPlacement_Test_C : public APalRandomIncidentObjectPlacement
{
    class UBP_PalRandomIncidentPlacementDropItemDataComponent_C* BP_PalRandomIncidentPlacementDropItemDataComponent3; // 0x02B0 (size: 0x8)
    class UBP_PalRandomIncidentPlacementEggDataComponent_C* BP_PalRandomIncidentPlacementEggDataComponent2; // 0x02B8 (size: 0x8)
    class UBP_PalRandomIncidentPlacementEggDataComponent_C* BP_PalRandomIncidentPlacementEggDataComponent1; // 0x02C0 (size: 0x8)
    class UBP_PalRandomIncidentPlacementDropItemDataComponent_C* BP_PalRandomIncidentPlacementDropItemDataComponent2; // 0x02C8 (size: 0x8)
    class UBP_PalRandomIncidentPlacementDropItemDataComponent_C* BP_PalRandomIncidentPlacementDropItemDataComponent1; // 0x02D0 (size: 0x8)
    class UBP_PalRandomIncidentPlacementDropItemDataComponent_C* BP_PalRandomIncidentPlacementDropItemDataComponent; // 0x02D8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x02E8 (size: 0x8)
    class UBP_PalRandomIncidentPlacementEggDataComponent_C* BP_PalRandomIncidentPlacementEggDataComponent; // 0x02F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x02F8 (size: 0x8)
    class USceneComponent* DefaultSceneRoot;                                          // 0x0300 (size: 0x8)

}; // Size: 0x308

#endif
